{
  "architectures": [
    "SLLamaForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "attn_reduction_type": "pwa",
  "bos_token_id": 1,
  "emb_reduction_type": "repeat",
  "eos_token_id": 2,
  "head_dim": 16,
  "hidden_act": "silu",
  "hidden_size": 64,
  "initializer_range": 0.02,
  "intermediate_size": 192,
  "layer_reduction_type": "share",
  "max_position_embeddings": 256,
  "mlp_bias": false,
  "mlp_reduction": true,
  "model_type": "sllama",
  "n_group": 1,
  "num_attention_heads": 4,
  "num_hidden_layers": 6,
  "num_key_value_heads": 4,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.46.3",
  "use_cache": true,
  "vocab_size": 32000
}
